[
    {
        "id": 1,
        "image": "https://i.postimg.cc/zvv7M9CW/ahashan-Monjil-Dhaka.jpg",
        "estate_title": "Ahasan Monjil Dhaka",
        "segment_name": "Historical Site",
        "description": "Discover the historical beauty of Ahasan Monjil, a magnificent palace in Dhaka that reflects the rich cultural heritage of Bangladesh. Originally built in the 19th century, this architectural marvel blends Mughal and European styles. The palace is a symbol of the opulence and grandeur of the era, with its intricate woodwork, ornate furnishings, and majestic gardens. It is a perfect destination for history enthusiasts, culture lovers, and anyone fascinated by colonial architecture. Visitors can explore its fascinating interior, including royal chambers and galleries filled with artifacts. Located near the river, the palace offers picturesque views that add to its historical charm. Ideal for those looking to experience the elegance and artistry of Bangladesh’s past, Ahasan Monjil offers a glimpse into the luxurious lifestyle of the bygone era. The palace has been restored over time to preserve its historical integrity, with meticulous attention to its rich detailing. Guided tours provide an immersive experience, explaining the significance of each room and the stories behind the architecture. Whether you're a history buff or simply someone in awe of architectural beauty, Ahasan Monjil remains an unmissable gem in the heart of Dhaka.",
        "price": "$1,500,000",
        "status": "sale",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Historical architecture", "Guided tours", "Nearby amenities"],
        "area": "N/A",
        "button_text": "Add to Buy"
    },
    {
        "id": 2,
        "image": "https://i.postimg.cc/vm706781/bashundhara-Dhaka.jpg",
        "estate_title": "Bashundhara Residential",
        "segment_name": "Residential Complex",
        "description": "Bashundhara Residential is a premier residential community located in one of Dhaka’s most prestigious neighborhoods. Offering a range of modern apartments and luxurious amenities, this complex provides the perfect blend of comfort and security. With its spacious apartments, modern facilities, and landscaped gardens, residents enjoy a quality lifestyle with easy access to essential services such as schools, hospitals, and shopping centers. The development features world-class facilities such as a swimming pool, fitness center, and jogging track, as well as 24/7 security to ensure peace of mind for its residents. Whether you're looking to rent or buy, Bashundhara Residential is the ideal choice for those who want to live in a safe and convenient environment. The complex’s close proximity to Dhaka’s commercial and cultural hubs makes it an attractive destination for families and working professionals. Spacious apartments offer comfortable living with modern kitchen facilities and smart home features, making it the epitome of urban living. With green spaces for relaxation and plenty of recreational options, Bashundhara Residential is perfect for anyone seeking an elevated lifestyle in a family-friendly, secure setting.",
        "price": "Not for Sale",
        "status": "rent",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Gym", "Swimming Pool", "24/7 Security"],
        "area": "3500 sq ft",
        "button_text": "Add to Rent"
    },
    {
        "id": 3,
        "image": "https://i.postimg.cc/76xm1CbK/cox-sbazar-Station.jpg",
        "estate_title": "Cox's Bazar Beachfront",
        "segment_name": "Vacation Property",
        "description": "Indulge in luxury with this breathtaking beachfront property in Cox's Bazar. The property is located along one of the longest unbroken sandy beaches in the world, offering panoramic views of the Bay of Bengal. Ideal for vacationers seeking a tranquil getaway, this beachfront estate provides private beach access, luxurious living spaces, and a variety of recreational facilities. The spacious home features multiple bedrooms, expansive living areas, and a fully equipped kitchen, perfect for family gatherings or hosting guests. Enjoy outdoor activities such as water sports or simply relax by the beach with stunning ocean views. The property also offers proximity to local attractions, shopping centers, and fine dining. Whether you're soaking up the sun on the private beach or taking a dip in the outdoor pool, this property offers the ultimate coastal retreat. The interior of the home has been designed with elegance and comfort in mind, offering spacious rooms that ensure a relaxing stay. Ideal for those looking to escape city life and enjoy the peace and serenity of nature, Cox's Bazar Beachfront is the ultimate vacation destination.",
        "price": "$2,300,000",
        "status": "sale",
        "location": "Cox's Bazar, Bangladesh",
        "facilities": ["Ocean view", "Private beach access", "Nearby shopping"],
        "area": "4500 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 4,
        "image": "https://i.postimg.cc/dQ5SB92r/dream-Holiday-Narshingdi.jpg",
        "estate_title": "Dream Holiday Resort",
        "segment_name": "Resort",
        "description": "Escape to nature at Dream Holiday Resort, a serene getaway located in Narshingdi, Bangladesh. The resort offers premium relaxation amenities such as a spacious swimming pool, a full-service spa, and various outdoor activities that cater to families and groups. Surrounded by lush greenery, this tranquil destination is perfect for those seeking a break from the daily grind. The resort also features comfortable lodging with rooms designed to provide maximum comfort and privacy. Whether you're looking to relax with a massage, enjoy the peaceful surroundings, or indulge in local cuisine at the on-site restaurant, Dream Holiday Resort is designed to offer a rejuvenating experience. Additionally, guests can enjoy activities like hiking and guided nature tours, making it an ideal location for those wanting to experience the beauty of Bangladesh’s natural landscape. The resort’s commitment to providing a peaceful and luxurious escape makes it a great choice for family vacations or corporate retreats.",
        "price": "$800 per person",
        "status": "rent",
        "location": "Narshingdi, Bangladesh",
        "facilities": ["Swimming pool", "Spa", "Outdoor activities"],
        "area": "N/A",
        "button_text": "Add to Rent"
    },
    {
        "id": 5,
        "image": "https://i.postimg.cc/NM4CZ6Wh/fantasy-Kingdom-Dhaka.jpg",
        "estate_title": "Fantasy Kingdom Resort",
        "segment_name": "Resort",
        "description": "Stay and play at Fantasy Kingdom Resort in Dhaka, where family-friendly attractions meet luxurious accommodations. This vibrant resort features a theme park with rides and entertainment options for all ages, from thrilling roller coasters to gentle carousels for younger children. After a fun-filled day, relax in the comfortable family suites, equipped with modern amenities and spacious living areas. The resort also offers a selection of on-site restaurants, serving a variety of cuisines to suit all tastes. With its entertainment-packed offerings, Fantasy Kingdom Resort ensures that families can make memories that will last a lifetime. Whether you're enjoying an exciting day at the park or unwinding in the resort's luxurious surroundings, Fantasy Kingdom Resort offers something for everyone. The combination of comfort, excitement, and dining options makes it a top choice for family vacations in Dhaka.",
        "price": "$100 per person",
        "status": "rent",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Family suites", "Theme park access", "Restaurant"],
        "area": "N/A",
        "button_text": "Add to Rent"
    },
    {
        "id": 6,
        "image": "https://i.postimg.cc/5NHpmWNW/glass-House-Gulshan.jpg",
        "estate_title": "Glass House",
        "segment_name": "Modern Villa",
        "description": "Experience luxury living at the Glass House, a contemporary villa featuring an all-glass design. This exclusive property is a marvel of modern architecture, with seamless indoor-outdoor living that provides a connection to nature while enjoying the comfort of a luxurious home. The villa features an infinity pool, smart home technology, and a rooftop garden, offering unparalleled views of the surrounding cityscape. Every detail has been carefully crafted to ensure an elegant and sustainable lifestyle. Whether relaxing in the spacious living areas or hosting events in the stunning outdoor spaces, the Glass House offers an exceptional living experience for those seeking sophistication and innovation. The villa's eco-friendly design, incorporating natural materials and energy-efficient features, adds to its charm and sustainability. The home is perfect for those who appreciate cutting-edge design and want to live in a space that combines style and function seamlessly.",
        "price": "$5,000,000",
        "status": "sale",
        "location": "Gulshan, Bangladesh",
        "facilities": ["Infinity pool", "Smart home features", "Rooftop garden"],
        "area": "5000 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 7,
        "image": "https://i.postimg.cc/D0N6KB6N/greenvalley-Natore.jpg",
        "estate_title": "Green Valley Resort",
        "segment_name": "Eco-Resort",
        "description": "Reconnect with nature at Green Valley Resort, an eco-friendly retreat in the heart of Natore. Surrounded by lush forests and rolling hills, this resort offers an opportunity to escape the hustle and bustle of city life. The resort emphasizes sustainability, with eco-conscious accommodations and a commitment to preserving the surrounding environment. Guests can enjoy nature walks, bird watching, and other outdoor activities, or simply relax in the serene surroundings. The rooms are designed with local materials and are equipped with all the modern amenities you need for a comfortable stay. Green Valley Resort is the perfect destination for eco-tourism enthusiasts or anyone looking for a peaceful and rejuvenating experience.",
        "price": "$500 per person",
        "status": "rent",
        "location": "Natore, Bangladesh",
        "facilities": ["Eco-friendly accommodations", "Nature walks", "Bird watching"],
        "area": "N/A",
        "button_text": "Add to Rent"
    },
    {
        "id": 8,
        "image": "https://i.postimg.cc/7Ptm7Z4N/gulshan-Dhaka.jpg",
        "estate_title": "Gulshan Villa",
        "segment_name": "Luxury Villa",
        "description": "Gulshan Villa offers a unique blend of opulence and comfort, making it an ideal choice for those seeking a luxurious lifestyle in Dhaka. This villa is designed to meet the highest standards of modern living, with large, airy rooms, beautiful landscaping, and exceptional amenities. The villa offers expansive living spaces, including multiple bedrooms and bathrooms, a modern kitchen, and elegant dining areas. The outdoor spaces include a private garden and swimming pool, perfect for entertaining guests or enjoying quiet family moments. Located in one of Dhaka’s most sought-after neighborhoods, Gulshan Villa is ideal for those who wish to live close to top-notch shopping, dining, and cultural attractions. The villa’s luxurious design and prime location make it an exceptional property for those who appreciate the finer things in life.",
        "price": "$4,000,000",
        "status": "sale",
        "location": "Gulshan, Dhaka",
        "facilities": ["Private garden", "Swimming pool", "Luxury amenities"],
        "area": "6500 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 9,
        "image": "https://i.postimg.cc/cLwmV7nD/House-Daka.jpg",
        "estate_title": "Colonial House",
        "segment_name": "Historical Property",
        "description": "Step back in time with this grand colonial-style house located in the heart of Dhaka. This meticulously preserved historical property blends traditional architectural elements with modern luxuries, making it a perfect choice for those looking for a unique living experience. The house features high ceilings, ornate woodwork, and a series of beautiful, intricately designed rooms. Spacious living areas are adorned with antique furniture and period details that evoke a sense of nostalgia, while the expansive windows allow for ample natural light, giving the space an airy and welcoming feel. The property also includes large verandas, offering stunning views of the surrounding area. The garden is lush and well-maintained, providing a tranquil outdoor retreat that complements the historic charm of the home. Located in one of Dhaka’s most prestigious neighborhoods, this house offers an opportunity to experience the cultural richness of Bangladesh.",
        "price": "$1,200,000",
        "status": "sale",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Garden", "Veranda", "Historic Architecture"],
        "area": "4500 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 10,
        "image": "https://i.postimg.cc/B6MNmqK4/kuthibari-Kushtia.jpg",
        "estate_title": "Kuthibari Residence",
        "segment_name": "Heritage Property",
        "description": "Kuthibari Residence, located in Kushtia, is an iconic heritage property that offers a glimpse into the historical and cultural roots of Bangladesh. This property features traditional Bengali architecture, with intricate detailing, large courtyards, and expansive grounds. The house is an architectural masterpiece, with a spacious layout that has been carefully preserved over the years. The surrounding gardens are lush and ideal for quiet walks or gatherings. Kuthibari Residence stands as a testament to the rich heritage of Bangladesh and offers a rare opportunity to own a piece of the country's history. Ideal for history buffs or those looking for a distinctive property with character, Kuthibari Residence combines history with modern amenities, making it a unique place to live.",
        "price": "$750,000",
        "status": "sale",
        "location": "Kushtia, Bangladesh",
        "facilities": ["Heritage architecture", "Large gardens", "Courtyards"],
        "area": "5000 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 11,
        "image": "https://i.postimg.cc/BQt7w1py/military-Academy-Daka.png",
        "estate_title": "Military Academy",
        "segment_name": "Educational Facility",
        "description": "The Military Academy in Dhaka is an elite educational facility offering rigorous training and education for future leaders of the armed forces. With state-of-the-art facilities, advanced technology, and a highly skilled faculty, the academy provides an unmatched environment for leadership development. The sprawling campus is equipped with modern classrooms, training fields, and recreational areas. The academy focuses on academic excellence, physical fitness, and leadership skills, preparing its cadets to serve their country with honor. The Military Academy is one of the top institutions for aspiring military officers in Bangladesh and plays a crucial role in shaping the future of the nation’s defense sector.",
        "price": "N/A",
        "status": "institution",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Advanced classrooms", "Training fields", "Recreational areas"],
        "area": "N/A",
        "button_text": "Add to Enroll"
    }
]
