[
    {
        "id": 1,
        "image": "https://i.postimg.cc/zvv7M9CW/ahashan-Monjil-Dhaka.jpg",
        "estate_title": "Ahasan Monjil Dhaka",
        "segment_name": "Historical Site",
        "description": "Ahasan Monjil is a magnificent palace in Dhaka, showcasing the opulence of the 19th century. It blends Mughal and European architecture, offering a historical glimpse into Bangladesh’s past. The palace features intricately designed woodwork, ornate furniture, and sprawling gardens, making it a must-see for history lovers. Visitors can explore the royal chambers, art galleries, and historical artifacts that tell the story of the royal family. Located by the river, it offers a peaceful retreat with scenic views. The palace has been preserved and restored to its former glory, with guided tours providing detailed insights into its history. This site captures the grandeur and sophistication of a bygone era, serving as a symbol of Dhaka’s rich cultural heritage.",
        "price": "$1,500,000",
        "status": "sale",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Architecture", "Gardens", "Tours"],
        "area": "N/A",
        "button_text": "Add to Buy"
    },
    {
        "id": 2,
        "image": "https://i.postimg.cc/vm706781/bashundhara-Dhaka.jpg",
        "estate_title": "Bashundhara Residential",
        "segment_name": "Residential Complex",
        "description": "Bashundhara Residential offers a luxurious lifestyle in Dhaka. The community features modern apartments with top-tier amenities, including a gym, swimming pool, and 24/7 security. It is set in a prime location with easy access to schools, hospitals, and shopping centers. The well-maintained green spaces and serene environment make it ideal for families. Whether you're looking to rent or buy, Bashundhara provides comfortable and secure living, offering everything you need for a convenient urban lifestyle. Spacious apartments ensure a comfortable living experience with modern kitchens and smart home technology. With its blend of luxury and convenience, it’s an ideal choice for anyone seeking to live in Dhaka’s most desirable residential area.",
        "price": "Not for Sale",
        "status": "rent",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Gym", "Pool", "Security"],
        "area": "3500 sq ft",
        "button_text": "Add to Rent"
    },
    {
        "id": 3,
        "image": "https://i.postimg.cc/76xm1CbK/cox-sbazar-Station.jpg",
        "estate_title": "Cox's Bazar Beachfront",
        "segment_name": "Vacation Property",
        "description": "Located along the world’s longest natural sandy beach, Cox's Bazar Beachfront offers an unforgettable coastal experience. This property boasts a private beach, ideal for relaxation and water sports. The villa features spacious rooms, an outdoor pool, and modern kitchen facilities. Guests can enjoy stunning ocean views and unwind in luxury, with ample opportunities for local excursions and dining. Whether soaking up the sun, enjoying a swim, or exploring nearby attractions, this beachfront property is the perfect getaway for those seeking tranquility and adventure. It’s a fantastic choice for those wanting a retreat with breathtaking views and all the comforts of home.",
        "price": "$2,300,000",
        "status": "sale",
        "location": "Cox's Bazar, Bangladesh",
        "facilities": ["Ocean", "Beach", "Pool"],
        "area": "4500 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 4,
        "image": "https://i.postimg.cc/dQ5SB92r/dream-Holiday-Narshingdi.jpg",
        "estate_title": "Dream Holiday Resort",
        "segment_name": "Resort",
        "description": "Dream Holiday Resort in Narshingdi offers a peaceful retreat with excellent amenities such as a swimming pool, a full-service spa, and various outdoor activities like hiking. Surrounded by nature, it provides an ideal setting for relaxation and family fun. Guests can enjoy outdoor tours or relax by the pool in serene surroundings. The resort emphasizes comfort with its cozy rooms, top-notch dining options, and friendly service. Whether you're planning a weekend getaway or a longer stay, Dream Holiday Resort ensures a memorable experience for all guests.",
        "price": "$800 per person",
        "status": "rent",
        "location": "Narshingdi, Bangladesh",
        "facilities": ["Pool", "Spa", "Tours"],
        "area": "N/A",
        "button_text": "Add to Rent"
    },
    {
        "id": 5,
        "image": "https://i.postimg.cc/NM4CZ6Wh/fantasy-Kingdom-Dhaka.jpg",
        "estate_title": "Fantasy Kingdom Resort",
        "segment_name": "Resort",
        "description": "Fantasy Kingdom Resort in Dhaka is a family-oriented destination offering a thrilling theme park experience with rides, attractions, and entertainment. The resort also provides modern accommodation, dining, and leisure facilities, ensuring a perfect balance of fun and relaxation. Guests can explore the theme park and then retreat to spacious rooms designed for comfort and convenience. The combination of excitement and comfort makes it an ideal place for family vacations. Fantasy Kingdom Resort offers everything needed for an unforgettable adventure, from roller coasters to gourmet meals.",
        "price": "$100 per person",
        "status": "rent",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Park", "Dining", "Suites"],
        "area": "N/A",
        "button_text": "Add to Rent"
    },
    {
        "id": 6,
        "image": "https://i.postimg.cc/5NHpmWNW/glass-House-Gulshan.jpg",
        "estate_title": "Glass House",
        "segment_name": "Modern Villa",
        "description": "The Glass House in Gulshan is a modern architectural wonder featuring a transparent design that offers unparalleled views of the surrounding cityscape. This luxurious villa comes with smart home features, an infinity pool, and a rooftop garden for relaxation. The open-concept living spaces create a sense of spaciousness, while the eco-friendly design ensures sustainability. Perfect for those seeking innovation, the Glass House is the epitome of contemporary living, combining style and function in a stunning urban setting.",
        "price": "$5,000,000",
        "status": "sale",
        "location": "Gulshan, Bangladesh",
        "facilities": ["Pool", "Smart", "Garden"],
        "area": "5000 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 7,
        "image": "https://i.postimg.cc/D0N6KB6N/greenvalley-Natore.jpg",
        "estate_title": "Green Valley Resort",
        "segment_name": "Eco-Resort",
        "description": "Green Valley Resort offers an eco-friendly escape amidst nature. Located in Natore, the resort focuses on sustainability with eco-conscious rooms, nature walks, and birdwatching tours. Guests can enjoy organic meals, relax in the surrounding greenery, and unwind in the serene environment. Perfect for eco-tourism lovers or anyone seeking a peaceful getaway, Green Valley Resort blends modern comforts with an appreciation for the natural world.",
        "price": "$500 per person",
        "status": "rent",
        "location": "Natore, Bangladesh",
        "facilities": ["Eco", "Walks", "Birdwatching"],
        "area": "N/A",
        "button_text": "Add to Rent"
    },
    {
        "id": 8,
        "image": "https://i.postimg.cc/7Ptm7Z4N/gulshan-Dhaka.jpg",
        "estate_title": "Gulshan Villa",
        "segment_name": "Luxury Villa",
        "description": "Gulshan Villa offers the perfect blend of luxury and comfort in one of Dhaka’s prime locations. With spacious living areas, private gardens, and a swimming pool, this villa provides the ultimate living experience. The villa is designed with modern aesthetics, offering a sophisticated lifestyle for families. Its location close to shopping and dining hubs adds convenience, making it an ideal place for those seeking both comfort and accessibility in Dhaka.",
        "price": "$4,000,000",
        "status": "sale",
        "location": "Gulshan, Dhaka",
        "facilities": ["Garden", "Pool", "Luxury"],
        "area": "6500 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 9,
        "image": "https://i.postimg.cc/cLwmV7nD/House-Daka.jpg",
        "estate_title": "Colonial House",
        "segment_name": "Historical Property",
        "description": "Colonial House in Dhaka is a preserved property that offers a rich history with modern comforts. The house features colonial-style architecture, expansive rooms, and beautifully designed verandas that overlook lush gardens. This unique property allows you to experience the charm of a bygone era while living in the heart of Dhaka. It’s perfect for those interested in history and culture, offering a rare opportunity to own a piece of Bangladesh’s architectural heritage.",
        "price": "$1,200,000",
        "status": "sale",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Colonial", "Verandas", "Gardens"],
        "area": "4500 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 10,
        "image": "https://i.postimg.cc/B6MNmqK4/kuthibari-Kushtia.jpg",
        "estate_title": "Kuthibari Residence",
        "segment_name": "Heritage Property",
        "description": "Kuthibari Residence in Kushtia is a historical property that showcases traditional Bengali architecture. It offers large courtyards, lush gardens, and expansive living spaces. The house has been preserved to maintain its authentic character, making it a perfect choice for those interested in heritage properties. It combines the charm of the past with modern amenities, providing a peaceful living environment in the heart of a culturally rich area.",
        "price": "$750,000",
        "status": "sale",
        "location": "Kushtia, Bangladesh",
        "facilities": ["Heritage", "Gardens", "Courtyards"],
        "area": "5000 sq ft",
        "button_text": "Add to Buy"
    },
    {
        "id": 11,
        "image": "https://i.postimg.cc/BQt7w1py/military-Academy-Daka.png",
        "estate_title": "Military Academy",
        "segment_name": "Educational Facility",
        "description": "The Military Academy in Dhaka is a prestigious institution offering rigorous training for future leaders of Bangladesh’s armed forces. Equipped with advanced classrooms and training fields, the academy focuses on developing leadership, discipline, and physical fitness. It provides an unparalleled educational experience, preparing cadets for a career in the military.",
        "price": "N/A",
        "status": "institution",
        "location": "Dhaka, Bangladesh",
        "facilities": ["Training", "Classrooms", "Fitness"],
        "area": "N/A",
        "button_text": "Add to Enroll"
    }
]
